Rasnar/SmartCanton/dev/MKW41z/smartcanton_devbox_board/pin_mux.c
	PORT_SetPinMux(PORTA, PIN0_IDX, kPORT_MuxAlt7); /* PORTA0 (pin 1) is configured as SWD_DIO */
	PORT_SetPinMux(PORTA, PIN1_IDX, kPORT_MuxAlt7); /* PORTA1 (pin 2) is configured as SWD_CLK */
	PORT_SetPinMux(PORTA, PIN16_IDX, kPORT_MuxAsGpio); /* PORTA16 (pin 4) is configured as PTA16 */
	PORT_SetPinMux(PORTA, PIN17_IDX, kPORT_MuxAsGpio); /* PORTA17 (pin 5) is configured as PTA17 */
	PORT_SetPinMux(PORTA, PIN18_IDX, kPORT_MuxAsGpio); /* PORTA18 (pin 6) is configured as PTA18 */
	PORT_SetPinMux(PORTA, PIN19_IDX, kPORT_MuxAsGpio); /* PORTA19 (pin 7) is configured as PTA19 */
	PORT_SetPinMux(PORTA, PIN2_IDX, kPORT_MuxAlt7); /* PORTA2 (pin 3) is configured as RESET_b */
	PORT_SetPinMux(PORTB, PIN0_IDX, kPORT_MuxAlt3); /* PORTB0 (pin 16) is configured as I2C0_SCL */
	PORT_SetPinMux(PORTB, PIN1_IDX, kPORT_MuxAlt3); /* PORTB1 (pin 17) is configured as I2C0_SDA */
	PORT_SetPinMux(PORTB, PIN16_IDX, kPORT_PinDisabledOrAnalog); /* PORTB16 (pin 21) is configured as EXTAL32K */
	PORT_SetPinMux(PORTB, PIN17_IDX, kPORT_PinDisabledOrAnalog); /* PORTB17 (pin 22) is configured as XTAL32K */
	PORT_SetPinMux(PORTB, PIN18_IDX, kPORT_PinDisabledOrAnalog); /* PORTB18 (pin 23) is configured as ADC0_SE4 */
	PORT_SetPinMux(PORTB, PIN2_IDX, kPORT_MuxAsGpio); /* PORTB2 (pin 18) is configured as PTB2 */
	PORT_SetPinMux(PORTB, PIN3_IDX, kPORT_MuxAsGpio); /* PORTB3 (pin 19) is configured as PTB3 */
	PORTB->PCR[3] = ((PORTB->PCR[3] & (~(PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK))) /* Mask bits to zero which are setting */
	| PORT_PCR_SRE(PCR_SRE_SLOW) /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is configured as a digital output. */
	);
	PORT_SetPinMux(PORTC, PIN1_IDX, kPORT_MuxAsGpio); /* PORTC1 (pin 37) is configured as PTC1 */
	PORT_SetPinMux(PORTC, PIN16_IDX, kPORT_MuxAlt2); /* PORTC16 (pin 45) is configured as SPI0_SCK */
	PORT_SetPinMux(PORTC, PIN17_IDX, kPORT_MuxAlt2); /* PORTC17 (pin 46) is configured as SPI0_SOUT */
	PORT_SetPinMux(PORTC, PIN18_IDX, kPORT_MuxAlt2); /* PORTC18 (pin 47) is configured as SPI0_SIN */
	PORT_SetPinMux(PORTC, PIN19_IDX, kPORT_MuxAsGpio); /* PORTC19 (pin 48) is configured as PTC19 */
	PORT_SetPinMux(PORTC, PIN2_IDX, kPORT_MuxAlt4); /* PORTC2 (pin 38) is configured as UART0_RX */
	PORT_SetPinMux(PORTC, PIN3_IDX, kPORT_MuxAlt4); /* PORTC3 (pin 39) is configured as UART0_TX */
	PORT_SetPinMux(PORTC, PIN4_IDX, kPORT_MuxAsGpio); /* PORTC4 (pin 40) is configured as PTC4 */
	PORT_SetPinMux(PORTC, PIN5_IDX, kPORT_MuxAsGpio); /* PORTC5 (pin 41) is configured as PTC5 */
	PORT_SetPinMux(PORTC, PIN6_IDX, kPORT_MuxAlt3); /* PORTC6 (pin 42) is configured as I2C1_SCL */
	PORT_SetPinMux(PORTC, PIN7_IDX, kPORT_MuxAlt3); /* PORTC7 (pin 43) is configured as I2C1_SDA */
	SIM->SOPT5 = ((SIM->SOPT5 & (~(SIM_SOPT5_LPUART0TXSRC_MASK | SIM_SOPT5_LPUART0RXSRC_MASK))) /* Mask bits to zero which are setting */
	| SIM_SOPT5_LPUART0TXSRC(SOPT5_LPUART0TXSRC_LPUART_TX) /* LPUART0 Transmit Data Source Select: LPUART0_TX pin */
	| SIM_SOPT5_LPUART0RXSRC(SOPT5_LPUART0RXSRC_LPUART_RX) /* LPUART0 Receive Data Source Select: LPUART_RX pin */
	);
}

/*
 * TEXT BELOW IS USED AS SETTING FOR THE PINS TOOL *****************************
 BOARD_InitButtons:
 - options: {coreID: singlecore, enableClock: 'true'}
 - pin_list:
 - {pin_num: '40', peripheral: GPIOC, signal: 'GPIO, 4', pin_signal: TSI0_CH0/PTC4/LLWU_P12/ANT_A/EXTRG_IN/UART0_CTS_b/TPM1_CH0/BSM_DATA}
 - {pin_num: '41', peripheral: GPIOC, signal: 'GPIO, 5', pin_signal: TSI0_CH1/PTC5/LLWU_P13/RF_NOT_ALLOWED/LPTMR0_ALT2/UART0_RTS_b/TPM1_CH1/BSM_CLK}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR THE PINS TOOL ***
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitButtons
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitButtons(void)
{
	CLOCK_EnableClock(kCLOCK_PortB); /* Port C Clock Gate Control: Clock enabled */

	PORT_SetPinMux(PORTB, PIN2_IDX, kPORT_MuxAsGpio); /* PORTB2 (pin 18) is configured as PTB2 */
	PORT_SetPinMux(PORTB, PIN3_IDX, kPORT_MuxAsGpio); /* PORTB3 (pin 19) is configured as PTB3 */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR THE PINS TOOL *****************************
 BOARD_InitLEDs:
 - options: {coreID: singlecore, enableClock: 'true'}
 - pin_list:
 - {pin_num: '4', peripheral: GPIOA, signal: 'GPIO, 16', pin_signal: TSI0_CH10/PTA16/LLWU_P4/SPI1_SOUT/TPM0_CH0, direction: OUTPUT}
 - {pin_num: '6', peripheral: GPIOA, signal: 'GPIO, 18', pin_signal: TSI0_CH12/PTA18/LLWU_P6/SPI1_SCK/TPM2_CH0, direction: OUTPUT}
 - {pin_num: '5', peripheral: GPIOA, signal: 'GPIO, 17', pin_signal: TSI0_CH11/PTA17/LLWU_P5/RF_RESET/SPI1_SIN/TPM_CLKIN1, direction: OUTPUT}
 - {pin_num: '7', peripheral: GPIOA, signal: 'GPIO, 19', pin_signal: TSI0_CH13/ADC0_SE5/PTA19/LLWU_P7/SPI1_PCS0/TPM2_CH1, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR THE PINS TOOL ***
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitLEDs
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitLEDs(void)
{
	CLOCK_EnableClock(kCLOCK_PortA); /* Port A Clock Gate Control: Clock enabled */

	PORT_SetPinMux(PORTA, PIN16_IDX, kPORT_MuxAsGpio); /* PORTA16 (pin 4) is configured as PTA16 */
	PORT_SetPinMux(PORTA, PIN17_IDX, kPORT_MuxAsGpio); /* PORTA17 (pin 5) is configured as PTA17 */
	PORT_SetPinMux(PORTA, PIN18_IDX, kPORT_MuxAsGpio); /* PORTA18 (pin 6) is configured as PTA18 */
	PORT_SetPinMux(PORTA, PIN19_IDX, kPORT_MuxAsGpio); /* PORTA19 (pin 7) is configured as PTA19 */

}

/*
 * TEXT BELOW IS USED AS SETTING FOR THE PINS TOOL *****************************
 BOARD_InitSPI:
 - options: {coreID: singlecore, enableClock: 'true'}
 - pin_list:
 - {pin_num: '47', peripheral: SPI0, signal: SIN, pin_signal: TSI0_CH6/PTC18/LLWU_P2/SPI0_SIN/I2C1_SDA/UART0_TX/BSM_DATA/DTM_TX}
 - {pin_num: '46', peripheral: SPI0, signal: SOUT, pin_signal: TSI0_CH5/PTC17/LLWU_P1/SPI0_SOUT/I2C1_SCL/UART0_RX/BSM_FRAME/DTM_RX}
 - {pin_num: '45', peripheral: SPI0, signal: SCK, pin_signal: TSI0_CH4/PTC16/LLWU_P0/SPI0_SCK/I2C0_SDA/UART0_RTS_b/TPM0_CH3}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR THE PINS TOOL ***
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitSPI
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitSPI(void)
{
	CLOCK_EnableClock(kCLOCK_PortC); /* Port C Clock Gate Control: Clock enabled */

