Rasnar/SmartCanton/dev/MKW41z/smartcanton_devbox_board/pin_mux.c
	PORT_SetPinMux(PORTC, PIN16_IDX, kPORT_MuxAlt2); /* PORTC16 (pin 45) is configured as SPI0_SCK */
	PORT_SetPinMux(PORTC, PIN17_IDX, kPORT_MuxAlt2); /* PORTC17 (pin 46) is configured as SPI0_SOUT */
	PORT_SetPinMux(PORTC, PIN18_IDX, kPORT_MuxAlt2); /* PORTC18 (pin 47) is configured as SPI0_SIN */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR THE PINS TOOL *****************************
 BOARD_InitLPUART:
 - options: {coreID: singlecore, enableClock: 'true'}
 - pin_list:
 - {pin_num: '38', peripheral: LPUART0, signal: RX, pin_signal: TSI0_CH14/PTC2/LLWU_P10/TX_SWITCH/I2C1_SCL/UART0_RX/CMT_IRO/DTM_RX}
 - {pin_num: '39', peripheral: LPUART0, signal: TX, pin_signal: TSI0_CH15/PTC3/LLWU_P11/RX_SWITCH/I2C1_SDA/UART0_TX/TPM0_CH1/DTM_TX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR THE PINS TOOL ***
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitLPUART
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitLPUART(void)
{
	CLOCK_EnableClock(kCLOCK_PortC); /* Port C Clock Gate Control: Clock enabled */

	PORT_SetPinMux(PORTC, PIN2_IDX, kPORT_MuxAlt4); /* PORTC2 (pin 38) is configured as UART0_RX */
	PORT_SetPinMux(PORTC, PIN3_IDX, kPORT_MuxAlt4); /* PORTC3 (pin 39) is configured as UART0_TX */
	SIM->SOPT5 = ((SIM->SOPT5 & (~(SIM_SOPT5_LPUART0TXSRC_MASK | SIM_SOPT5_LPUART0RXSRC_MASK))) /* Mask bits to zero which are setting */
	| SIM_SOPT5_LPUART0TXSRC(SOPT5_LPUART0TXSRC_LPUART_TX) /* LPUART0 Transmit Data Source Select: LPUART0_TX pin */
	| SIM_SOPT5_LPUART0RXSRC(SOPT5_LPUART0RXSRC_LPUART_RX) /* LPUART0 Receive Data Source Select: LPUART_RX pin */
	);
}

#define PCR_PE_ENABLED                0x01u   /*!< Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin, if the pin is configured as a digital input. */
#define PCR_PS_UP                     0x01u   /*!< Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the corresponding PE field is set. */
#define PIN0_IDX                         0u   /*!< Pin number for pin 0 in a port */
#define PIN1_IDX                         1u   /*!< Pin number for pin 1 in a port */
#define PIN2_IDX                         2u   /*!< Pin number for pin 2 in a port */
#define PIN3_IDX                         3u   /*!< Pin number for pin 3 in a port */

/*
 * TEXT BELOW IS USED AS SETTING FOR THE PINS TOOL *****************************
 BOARD_InitI2C:
 - options: {coreID: singlecore, enableClock: 'true'}
 - pin_list:
 - {pin_num: '16', peripheral: I2C0, signal: CLK, pin_signal: PTB0/LLWU_P8/XTAL_OUT_EN/I2C0_SCL/CMP0_OUT/TPM0_CH1/CLKOUT}
 - {pin_num: '17', peripheral: I2C0, signal: SDA, pin_signal: ADC0_SE1/CMP0_IN5/PTB1/DTM_RX/I2C0_SDA/LPTMR0_ALT1/TPM0_CH2/CMT_IRO}
 - {pin_num: '42', peripheral: I2C1, signal: CLK, pin_signal: TSI0_CH2/PTC6/LLWU_P14/XTAL_OUT_EN/I2C1_SCL/UART0_RX/TPM2_CH0/BSM_FRAME}
 - {pin_num: '43', peripheral: I2C1, signal: SDA, pin_signal: TSI0_CH3/PTC7/LLWU_P15/SPI0_PCS2/I2C1_SDA/UART0_TX/TPM2_CH1/BSM_DATA}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR THE PINS TOOL ***
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitI2C
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitI2C(void)
{
	CLOCK_EnableClock(kCLOCK_PortB); /* Port B Clock Gate Control: Clock enabled */
	CLOCK_EnableClock(kCLOCK_PortC); /* Port C Clock Gate Control: Clock enabled */

	PORT_SetPinMux(PORTB, PIN0_IDX, kPORT_MuxAlt3); /* PORTB0 (pin 16) is configured as I2C0_SCL */
	PORT_SetPinMux(PORTB, PIN1_IDX, kPORT_MuxAlt3); /* PORTB1 (pin 17) is configured as I2C0_SDA */
	PORT_SetPinMux(PORTC, PIN6_IDX, kPORT_MuxAlt3); /* PORTC6 (pin 42) is configured as I2C1_SCL */
	PORT_SetPinMux(PORTC, PIN7_IDX, kPORT_MuxAlt3); /* PORTC7 (pin 43) is configured as I2C1_SDA */

}

/*******************************************************************************
 * EOF
 ******************************************************************************/
